{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js Converter",
  "convertedBy": "Custom conversion for Vercel deployment",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "trained_transfer_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                224,
                224,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": false,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "trainable": false,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ]
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 128,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_output",
              "trainable": true,
              "units": 10,
              "activation": "softmax",
              "use_bias": true
            }
          }
        ],
        "input_layers": [
          [
            "input_layer",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense_output",
            0,
            0
          ]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            12544,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_output/kernel",
          "shape": [
            128,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_output/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}